Revit 2024 API
DisplacementPath.AncestorIdx Property
 Specifies the end point of the path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int AncestorIdx { get; set; }
Visual Basic
Public Property AncestorIdx As Integer
	Get
	Set
Visual C++
public:
property int AncestorIdx {
	int get ();
	void set (int value);
}
See Also
DisplacementPath Class
Autodesk.Revit.DB Namespace